app/controllers/users_controller.rb

  def create
    # Get user to see if they have already signed up
    @user = User.find_by_email(params[:user][:email]);

    # If user doesnt exist, make them, and attach referrer
    if @user.nil?

      cur_ip = IpAddress.find_by_address(request.env['HTTP_X_FORWARDED_FOR'])

      if !cur_ip
        cur_ip = IpAddress.create(
          :address => request.env['HTTP_X_FORWARDED_FOR'],
          :count => 0
        )
      end

      if cur_ip.count > 2
        return redirect_to root_path
      else
        cur_ip.count = cur_ip.count + 1
        cur_ip.save
      end

      @user = User.new(:email => params[:user][:email])

      @referred_by = User.find_by_referral_code(cookies[:h_ref])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'adiakritos@gmail.com' LIMIT 1
SELECT "ip_addresses".* FROM "ip_addresses" WHERE "ip_addresses"."address" IS NULL LIMIT 1
INSERT INTO "ip_addresses" ("address", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["address", nil], ["count", 0], ["created_at", Thu, 05 Nov 2015 08:47:57 UTC +00:00], ["updated_at", Thu, 05 Nov 2015 08:47:57 UTC +00:00]]
UPDATE "ip_addresses" SET "count" = 2, "updated_at" = '2015-11-05 06:46:20.973864' WHERE "ip_addresses"."id" = 1
SELECT "users".* FROM "users" WHERE "users"."referral_code" = 'e9513cab67' LIMIT 1

        @user.referrer = @referred_by
      end

      @user.save
---
INSERT INTO "users" ("created_at", "email", "referral_code", "referrer_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 05 Nov 2015 06:46:21 UTC +00:00], ["email", "adiakritos@gmail.com"], ["referral_code", "e9513cab67"], ["referrer_id", nil], ["updated_at", Thu, 05 Nov 2015 06:46:21 UTC +00:00]]

  def refer
    email = cookies[:h_email]

    @bodyId = 'refer'
    @is_mobile = mobile_device?

    @user = User.find_by_email(email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'adiakritos@gmail.com' LIMIT 1